tutorials/multiform/scalarMultiRegionFoam/coolingSpheresimple/0/fluid/T
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "$FOAM_CASE/constant/initialConditions";

#include "$FOAM_CASE/constant/D";

dimensions      [0 0 0 1 0 0 0];

internalField   uniform $Tinitial;

boundaryField
{
    inlet
    {
        type            zeroGradient;//fixedValue;
        value           uniform 0;
    }

    outlet
    {
        type            zeroGradient;
        inletValue      uniform $Tinitial;
        value           uniform $Tinitial;
    }

    wall
    {
        type            mappedContinuityFluid;
        RobinK          uniform 0;
        RobinF          uniform 0;
        RobinD          uniform $Dfluid;
        Dsolid          uniform $Dsolid;
        gradient        uniform 0;
        value           $internalField;
        //sampleMode      nearestPatchFace;
        average         1;
        setAverage      "none";
    }

    externalWall
    {
        type           zeroGradient;
        value          uniform $Tinitial;
    }

    #includeEtc "caseDicts/setConstraintTypes"
}


// ************************************************************************* //
