tutorials/multiform/scalarMultiRegionFoam/coolingSpheresimple/0/fluid/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

epsilonInlet      0.001;
mixingLengthInlet 0.007;

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform $epsilonInlet;

boundaryField
{
    inlet
    {
        type            turbulentMixingLengthDissipationRateInlet;
        mixingLength    $mixingLengthInlet;
        value           uniform $epsilonInlet;
    }

    outlet
    {
        type            inletOutlet;
        value           uniform $epsilonInlet;
        inletValue      uniform $epsilonInlet;
    }

    wall
    {
        type            compressible::epsilonWallFunction;
        value           uniform $epsilonInlet;
    }

    #includeEtc "caseDicts/setConstraintTypes"
}


// ************************************************************************* //
