tutorials/multiform/scalarMultiRegionFoam/coolingSpheresimple/0/fluid/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "$FOAM_CASE/constant/initialConditions";

dimensions      [ 1 -1 -2 0 0 0 0 ];

internalField   uniform $pInitial;

boundaryField
{
    outlet
    {
        type            fixedValue;
        value           uniform $pInitial;
    }

    inlet
    {
        type            fixedFluxPressure;
        value           uniform $pInitial;
    }

    wall
    {
        $inlet;
    }

    #includeEtc "caseDicts/setConstraintTypes"
}


// ************************************************************************* //
