tutorials/multiform/scalarMultiRegionFoam/coolingSpheresimple/0/solid/T
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "$FOAM_CASE/constant/initialConditions";

#include "$FOAM_CASE/constant/D";

dimensions      [ 0 0 0 1 0 0 0 ];

internalField   uniform $Tsolid;

boundaryField
{
    wall
    {
        type            mappedContinuitySolid;
        Dfluid          uniform $Dfluid;
        RobinK          uniform 0;
        RobinF          uniform 0;
        RobinD          uniform $Dsolid;
        gradient        0;
        value           $internalField;
        average         1;
        setAverage      "none";
    }
}

// ************************************************************************* //
