tutorials/multiform/scalarMultiRegionFoam/coolingSpheresimple/system/fluid/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    "T"
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-16;
        relTol          1e-2;
    }

    p_rgh
    {
        solver           GAMG;
        tolerance        1e-7;
        relTol           0.01;

        smoother         GaussSeidel;


        maxIter          100;
    }

    "(U|h|e|k|omega|epsilon)"
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-10;
        relTol          0.1;
    }

    p_rghFinal
    {
        $p_rgh;
        relTol         0;
    }

    "(U|h|e|k|omega|T)Final"
    {
        $U;
        relTol          0;
    }
}

PIMPLE
{
    outerCorrectorResidualControl //residualControl
    {
        ".*"
        {
            tolerance 1e-14;
            relTol    0;
        }

    }
    residualControl
    {
        ".*"   1e-14;

    }

    }
    nCorrectors     1;
    nNonOrthogonalCorrectors 0;
    pRefCell        0;
    pRefValue       0;
}

relaxationFactors
{
    equations
    {
        ".*" 1;
    }
}

// ************************************************************************* //
