tutorials/multiform/scalarMultiRegionFoam/coolingSpheresimple/system/solid/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    "T"
    {
        solver           PBiCGStab;
        preconditioner   DIC;
        tolerance        1e-16;
        relTol           0.01;
    }

    "TFinal"
    {
        $T;
        relTol           0;
    }
}

PIMPLE
{
    outerCorrectorResidualControl //residualControl
    {
        ".*"
        {
            tolerance 1e-14;
            relTol    0;
        }

    }
    residualControl
    {
        ".*"   1e-14;

    }
    nNonOrthogonalCorrectors 0;
}

relaxationFactors
{
    equations
    {
        ".*" 1;
    }
}

// ************************************************************************* //
