tutorials/multiform/scalarMultiRegionFoam/coolingSpheresimple/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "$FOAM_CASE/system/blockMeshDict"

actions
(
    {
        name    cs;
        type    cellSet;
        action  new;
        source  sphereToCell;
        sourceInfo
        {
            centre (0 0 0);
            radius $:geometry.sphere.radius;
        }
    }
    {
        name    solid;
        type    cellZoneSet;
        action  new;
        source  setToCellZone;
        sourceInfo { set cs; }
    }
);

// ************************************************************************* //
